app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (description like '%%')
---
  def index
    if
      name = params[:name]
      @articles = Article.search(name)

INSERT INTO "articles" ("name", "link", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "${_name}\n"], ["link", "${_link}"], ["description", "${_description}"], ["created_at", "2020-05-19 21:22:04.945458"], ["updated_at", "2020-05-19 21:22:04.945458"]]
---
  def create
    @article = Article.create!(article_params)

SELECT "articles".* FROM "articles" WHERE (description like '%%')
---
  def destroy
    @article = Article.find(params[:id])