app/controllers/mhps_controller.rb

SELECT "mhps".* FROM "mhps" WHERE (link like '%%')
---
  def index
    if
      name = params[:name]
      @mhps = Mhp.search(name)

INSERT INTO "mhps" ("name", "occupation", "address", "insurance", "accepting", "email", "phone", "bio", "link", "created_at", "updated_at", "imgref", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @mhp = Mhp.create!(mhp_params)

SELECT  "mhps".* FROM "mhps" WHERE "mhps"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "mhps" SET "imgref" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "mhps"."id" = $5  [["imgref", "iii"], ["latitude", "53.53018"], ["longitude", "-1.47284"], ["updated_at", "2020-05-12 00:21:23.006408"], ["id", 2]]
---
  def update
    @mhp = Mhp.find(params[:id])
    if @mhp.update!(mhp_params)

SELECT "mhps".* FROM "mhps" WHERE (link like '%%')
---
  def destroy
    @mhp = Mhp.find(params[:id])