app/controllers/reviews_controller.rb

  def index
    if
      name = params[:name]
      @reviews = Review.search(name)
---
SELECT "reviews".* FROM "reviews" WHERE (content like '%%')

  def create
    @review = Review.create!(review_params)
---
INSERT INTO "reviews" ("name", "content") VALUES ($1, $2) RETURNING "id"  [["name", "ike"], ["content", "aaah does it work tho"]]

  def destroy
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE (content like '%%')